{"inkVersion":21,"root":[[{"->":"startConversation"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"startConversation":[["^\"Are you okay? You were standing there and all of a sudden it looked like your soul had escaped from your body.\"","\n","^Without asking, the professor walks up to you and places his hand on your forehead.","\n","^\"Temperature normal, no excessive sweating, eyes slightly bloodshot.\"","\n","ev","str","^Push his hand away","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Let him continue","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^Wendell does not look happy. He seems to quickly understand his mistake and you can see the understanding on his face.","\n","^\"Forgive me. It's a habit from work. Usually my patients don't have a say when it comes to the examination.\" He starts writing down his observations in a notebook.","\n","^Cragan approaches you again, but this time he keeps his hands to himself.","\n","^\"Let us proceed.\" ",{"->":".^.^.^.continuedResearch"},"\n",{"#f":5}],"c-1":["^ ",{"->":".^.^.^.continuedResearch"},"\n",{"#f":5}]}],{"continuedResearch":["^\"No external injuries. Slightly faster breathing.\" ",{"->":".^.^.physicalExamination"},"\n",{"#f":1}],"physicalExamination":[["^He writes something in his notes. \"Would you like to add anything?\"","\n","ev","str","^\"I'm a little cold.\"","/str",{"VAR?":"has_touched_the_stone"},"/ev",{"*":".^.c-0","flg":21},"ev","str","^\"I feel like someone punched me in the stomach.\"","/str",{"VAR?":"had_a_snow_fight"},"/ev",{"*":".^.c-1","flg":21},"ev","str","^\"My head is throbbing, as if something is about to burst it.\"","/str",{"VAR?":"wanted_to_stop_the_vision"},{"VAR?":"has_escaped_the_tortures"},"!","&&","/ev",{"*":".^.c-2","flg":21},"ev","str","^\"That's all.\"","/str","/ev",{"*":".^.c-3","flg":20},{"c-0":["\n","^\"I felt the same when I approached the stone myself. A chill different from that during the winter. More ominous and piercing.\" ",{"->":".^.^.^"},"\n",{"#f":5}],"c-1":["\n","^\"Internal injuries? An unprecedented symptom until now. Perhaps a defensive reaction?\" ",{"->":".^.^.^"},"\n",{"#f":5}],"c-2":["\n","^\"Contact with a mystical object can end like this. However, I doubt that something similar will happen to you. The pain should subside by the evening.\" ",{"->":".^.^.^"},"\n",{"#f":5}],"c-3":["^ ",{"->":"experiment"},"\n",{"#f":5}]}],{"#f":1}],"#f":1}],"experiment":[["^\"Now that the research issues are behind us, let's move on to what you saw or experienced after contact with the stone. Tell me everything, don't leave out details.\"","\n","ev","str","^\"When I touched the stone, I felt cold. It was like it was seeping in.\"","/str",{"VAR?":"has_touched_the_stone"},"/ev",{"*":".^.c-0","flg":21},"ev","str","^\"I looked at the reflection and into the void. After a while, I saw signs floating in front of me and...\"","/str",{"VAR?":"had_a_vision"},"/ev",{"*":".^.c-1","flg":21},{"c-0":["^ ",{"->":"touch"},"\n",{"#f":5}],"c-1":["^ ",{"->":"vision"},"\n",{"#f":5}]}],{"#f":1}],"touch":[["^The professor takes notes on everything you say. At the same time, you can see on his face that he has experienced something similar.","\n","ev","str","^\"I heard someone's voice and asked who he was. In response, I heard a strange language that I didn't understand.\"","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","^...","\n",["ev","str","^\"Suddenly I felt something coming after me. I started to run, but something knocked me down after a while.\"","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","^\"That would explain the pain in the abdominal area. Please go on.\"","\n",["ev","str","^\"This thing attacked me. I managed to dodge another blow and escaped. Then I opened my eyes.\"","/str",{"VAR?":"snow_fight_lost"},"!","/ev",{"*":".^.c-0","flg":21},"ev","str","^\"The second blow came. I felt myself slipping to the ground. I closed my eyes and felt my life and soul flying out of me.\"","/str",{"VAR?":"snow_fight_lost"},"/ev",{"*":".^.c-1","flg":21},{"c-0":["\n","^\"So you were very lucky. For me you stood still, staring all the time at the stone. Just where did the pain come from if nothing attacked you in the real world?\"","\n","^The professor begins to wonder. He strokes his white beard, wrinkling his forehead and eyebrows. ",{"->":"conclusion"},"\n",{"#f":5}],"c-1":["\n","^\"It sounds ... awful. Forgive me for exposing you to something like that.\"","\n","^The professor removes his glasses and with the fingers of his left hand begins to slowly massage his closed eyelids. ",{"->":"conclusion"},"\n",{"#f":5}]}],{"#f":5}]}],{"#f":5}]}],{"#f":1}],"vision":[["^...","\n","ev","str","^\"The Golden Palace\"","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","^Professor Cragan opens his eyes wider. He wants to say something, but the words are stuck in his throat.","\n","^\"The stone showed you the very heart of Lucius. However, it has been stuck here for centuries, so.... would have to have access to your memories and thoughts. This is...\"","\n",["ev","str","^\"Sick.\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"Fascinating and terrifying at the same time\".","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^\"Impossible. Unless...\"","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n","^\"Well... Yes... Sick. You're right,\" he replies confusedly. \"What happened next?\" ",{"->":"vision.visionOfFuture"},"\n",{"#f":5}],"c-1":["\n","^\"If our theory is confirmed, further research will be needed to discover the whole truth! This is truly remarkable!\"","\n","^\"What was next? Please speak up.\" ",{"->":"vision.visionOfFuture"},"\n",{"#f":5}],"c-2":["\n","^\"Perhaps the old texts are true. Demons were in fact locked in these stones. Their power was limited, but strong enough to have an effect on those who would approach their prison.\"","\n","^\"Did the demon show you anything else?\" ",{"->":"vision.visionOfFuture"},"\n",{"#f":5}]}],{"#f":5}]}],{"visionOfFuture":[["ev","str","^\"I saw a statue of black stone standing in front of the palace. And then...\"","/str",{"VAR?":"has_seen_the_golden_palace"},"/ev",{"*":".^.c-0","flg":21},"ev","str","^\"I freed myself from the vision. I didn't want to see what he had prepared for me.\"","/str",{"VAR?":"has_seen_the_golden_palace"},"!","/ev",{"*":".^.c-1","flg":21},{"c-0":["\n","^...","\n",["ev","str","^\"...I became a god in the place of Lucius.\"","/str",{"VAR?":"became_a_god"},"/ev",{"*":".^.c-0","flg":21},"ev","str","^\"...I have become a cult leader who will betray the belief in the Golden Father.\"","/str",{"VAR?":"became_a_cult_leader"},"/ev",{"*":".^.c-1","flg":21},"ev","str","^\"...I escaped when the opportunity arose, when I regained some of my consciousness.\"","/str",{"VAR?":"became_a_god"},"!",{"VAR?":"became_a_cult_leader"},"!","&&",{"VAR?":"has_escaped_the_tortures"},"&&","/ev",{"*":".^.c-2","flg":21},"ev","str","^\"... I felt the cry of a thousand voices in my head. I fell to my knees, begging for death.\"","/str",{"VAR?":"became_a_god"},"!",{"VAR?":"became_a_cult_leader"},"!","&&",{"VAR?":"has_escaped_the_tortures"},"!","&&","/ev",{"*":".^.c-3","flg":21},{"c-0":["\n","^\"He deceives us and entices us with promises of greatness and power.\"","\n","^\"It's a demon. Of that I am sure.\" ",{"->":"conclusion"},"\n",{"#f":5}],"c-1":["\n","^\"Betrayal is only what would shake faith in Lucius to its very foundations. No wonder you were shown this image. Demons love chaos and betrayal.\" ",{"->":"conclusion"},"\n",{"#f":5}],"c-2":["\n","^\"If you had stayed there a little longer, perhaps we would have learnt more.\"","\n","^\"But you would be risking your life. It was a good thing you freed yourself from his influence.\" ",{"->":"conclusion"},"\n",{"#f":5}],"c-3":["\n","^\"He can't inflict a wound on the body, so he does it to consciousness. Soon the pain should subside.\" ",{"->":"conclusion"},"\n",{"#f":5}]}],{"#f":5}],"c-1":["\n","^\"The filthy image would probably be stuck in your thoughts for years. Nothing would be the same again as it was before.\" ",{"->":"conclusion"},"\n",{"#f":5}]}],{"#f":1}],"#f":1}],"conclusion":["^\"There is a demon trapped inside this stone. And not just any kind, I'm guessing. Personally, I don't know anyone we can trust with entrusting such valuable knowledge, so we have to decide for ourselves what to do with it.\" ","#","^questComplete:TheBlackStone:2","/#","\n","^The professor goes around the stone, looking carefully at its bases. He keeps his distance, however.\"","\n","^\"We cannot destroy him and the stone. However, we can try to imprison him better or persuade Lady Calpernia to have her people constantly guard the stone to protect it.\"","\n","^\"You were the one who undertook the attempt to examine the stone, so it is left to you to make the final decision.\" ",{"->":".^.decision"},"\n",{"decision":[["ev","str","^\"We have to try and destroy the stone.\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"Security needs to be strengthened. This thing can't get out.\"","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^\"I might be able to get Calpernia to put some soldiers on guard.\"","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n","^\"If we don't succeed, we will let the demon loose! Think how powerful it will be outside the cage!\"","\n",["ev","str","^\"I was the one who measured myself against the demon and I will be the one to decide. You are with me or...\" ","#","^Intimidation:8","/#","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"You may be right. Another way has to be found.\"","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"intimidateProfessor"},"\n",{"#f":5}],"c-1":["^ ",{"->":".^.^.^.^.^"},"\n",{"#f":5}]}],{"#f":5}],"c-1":["\n","^\"I have some books in my office that will allow us to create protective signs around the stone. Meet me there tonight.\" ","end","\n",{"#f":5}],"c-2":["\n","^\"May she be more eager to talk to you. I will pray to the Father for your success.\" ","end","\n",{"#f":5}]}],{"#f":1}],"#f":1}],"intimidateProfessor":[["ev",{"VAR?":"test_passed"},"/ev",{"->":".^.b","c":true},{"b":["\n","^After a moment's silence, Craig agrees with you nodding his head.","\n","^\"Meet me in my office in the evening. There we will discuss ways to destroy the stone.\" ","end","\n",{"->":".^.^.^.2"},null]}],["ev",{"VAR?":"test_passed"},"!","/ev",{"->":".^.b","c":true},{"b":["\n","^\"I cannot allow you to commit such a reckless act. Please hear me out and let's work together to figure out how to deal with this thing.\"","\n","ev","str","^\"Let it be. Let's try it your way.\"","/str","/ev",{"*":".^.c-0","flg":20},{"->":".^.^.^.2"},{"c-0":["^ ",{"->":"conclusion.decision"},"\n",{"#f":5}]}]}],"nop","\n",{"#f":1}],"global decl":["ev",false,{"VAR=":"has_touched_the_stone"},false,{"VAR=":"had_a_vision"},false,{"VAR=":"had_a_snow_fight"},false,{"VAR=":"has_seen_the_golden_palace"},false,{"VAR=":"became_a_god"},false,{"VAR=":"became_a_cult_leader"},false,{"VAR=":"has_escaped_the_tortures"},false,{"VAR=":"snow_fight_lost"},false,{"VAR=":"wanted_to_stop_the_vision"},false,{"VAR=":"test_passed"},"/ev","end",null],"#f":1}],"listDefs":{}}