{"inkVersion":21,"root":[[{"->":"Start"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"Start":[["^You look at the giant, who effortlessly rearranges one crate after another. When he notices you, he bursts out laughing.","\n","^\"Another skinny? The boss must have a lot of fun sending people like you to us. He wouldn't be amused if he took on the job himself with the likes of you to help.\"","\n","^\"Come on, don't be offended. Big Tom just wanted to make a joke. Well, get to work. These crates won't move by themselves!\"","\n","ev","str","^\"I am not an employee. I'm looking for a murderer.\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Help him move crates","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^\"Finally someone took care of it. Good. The boss kept claiming he was working on a solution. At least one sentence out of his mouth was true.\"","\n",["ev","str","^\"Why don't you tell me everything you know about the murder?\"","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ",{"->":"JackInvestigation"},"\n",{"#f":5}]}],{"#f":5}],"c-1":["\n","^The big man hands you one of the crates. You feel the pain tear your arms and try to knock you to the ground.","\n",["ev","str","^Try to stand and move the box ","#","^Strength:10","/#","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Let it go. You're not here to carry a crate.\"","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"Work"},"\n",{"#f":5}],"c-1":["\n","^The crate falls to the ground with a bang. You hear something inside crack into tiny pieces. The big man is not happy.\"","\n","^However, after a while he bursts out laughing and slaps you on the shoulder in a friendly manner.","\n","^\"It happens to everyone. Jack dropped three cases of tea into the water on the first day. He has a worthy replacement.\" ",{"->":"Questions"},"\n",{"#f":5}]}],{"#f":5}]}],{"#f":1}],"BossTruth":[["ev",{"VAR?":"test_passed"},"/ev",{"->":".^.b","c":true},{"b":["\n","^The man calms down. He begins to trust you.","\n","^\"The boss does illegal business with smugglers in the city. I saw him checking something in the crates from the last delivery. Earlier he called Jack into his office. After that, I didn't see him again.\" ","#","^questComplete:InvestigateLowerCityPort:2","/#","\n","^\"I don't know if the killer is the boss, but if so, arrange it so that no one gets hurt.\" ","#","^questStart:InvestigateLowerCityPort:3","/#","\n","^The big man picks up the crate and walks away. ","end","\n",{"->":".^.^.^.2"},null]}],["ev",{"VAR?":"test_passed"},"!","/ev",{"->":".^.b","c":true},{"b":["\n","^\"I said everything I know. Leave me alone, I have a lot of work to do.\" ","end","\n",{"->":".^.^.^.2"},null]}],"nop","\n",{"#f":1}],"Work":[["ev",{"VAR?":"test_passed"},"/ev",{"->":".^.b","c":true},{"b":["\n","^You pull yourself together and carry the box to the indicated place. A smile appears on the big man's face.","\n","^\"Frail and weak, but sturdy. Good, we need such.\" ",{"->":"Questions"},"\n",{"->":"Work.2"},null]}],["ev",{"VAR?":"test_passed"},"!","/ev",{"->":".^.b","c":true},{"b":["\n","^The crate falls to the ground with a bang. You hear something inside crack into tiny pieces. The big man is not happy.\"","\n","^However, after a while he bursts out laughing and slaps you on the shoulder in a friendly manner.","\n","^\"It happens to everyone. Jack dropped three cases of tea into the water on the first day. He has a worthy replacement.\" ",{"->":"Questions"},"\n",{"->":"Work.2"},null]}],"nop","\n",{"#f":1}],"Questions":[["^I'm Big Tom. Did they send you to replace Jack?\"","\n","ev","str","^\"Actually, I'm here to investigate his death. Will you tell me what you know?\"","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ",{"->":"JackInvestigation"},"\n",{"#f":5}]}],{"#f":1}],"JackInvestigation":["^The big man puts the crate on the ground and sits down on it.","\n","^\"Any of us could have done it. Jack would have gotten under everyone's skin sooner or later. That's the kind of person he was. From day one he tried to do everything to avoid work, but he hankered for money like no one else.\"","\n","^\"The day before he died, I overheard him threatening someone to reveal the truth about the operation of the port. I don't have the faintest idea what he was talking about, but to my knowledge it was something related to illegal shipments.\"","\n",["ev","str","^\"You know about the illegal business and you keep quiet? You are very loyal to your superior.\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"Illegal business in the port? Impossible.\"","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^\"I'm not looking for trouble. I just want to do my own thing and make a living. If I said something, they would quickly find another to take my place.\" ","#","^questComplete:InvestigateLowerCityPort:2","/#","\n","^\"If you want to snoop further, check out the latest transports, and maybe you'll learn something. Just don't come back to me with it.\" ","#","^questStart:InvestigateLowerCityPort:3","/#","\n","^The big man picks up the crate and walks away. ","end","\n",{"#f":5}],"c-1":["\n","^\"You can make quite a bit of money on this. Other than me, I think only Ralph knows about them. He once warned our boss that everyone would regret it if the truth came out.\" ","#","^questComplete:InvestigateLowerCityPort:2","/#","\n",["ev","str","^\"Maybe Ralph killed Jack?\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"Maybe it was your boss who ordered Jack's murder?\"","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^\"Maybe he's capable of it. Who knows. If you care about the truth, search the recently brought crates. Just don't reveal who you know it from.\" ","#","^questStart:InvestigateLowerCityPort:3","/#","\n","^The big man picks up the crate and walks away. ","end","\n",{"#f":5}],"c-1":["\n","^The man croaks and avoids your gaze. Your words have caused a stir in him.","\n",["ev","str","^\"I want to help. I won't if you don't tell me the truth.\" ","#","^Persuasion:15","/#","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"Tell me anything that can help and I'll leave you alone.\"","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["^ ",{"->":"BossTruth"},"\n",{"#f":5}],"c-1":["\n","^\"Check the latest deliveries. That's all I can say.\" ","#","^questComplete:InvestigateLowerCityPort:2","/#","\n","^\"Remember, we didn't talk.\" ","#","^questStart:InvestigateLowerCityPort:3","/#","\n","^The big man picks up the crate and walks away. ","end","\n",{"#f":5}]}],{"#f":5}]}],{"#f":5}]}],{"#f":1}],"global decl":["ev",false,{"VAR=":"test_passed"},"/ev","end",null],"#f":1}],"listDefs":{}}