{"inkVersion":21,"root":[[{"->":"Start"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"Start":[["^\"Good news? I hope you were able to establish something about Jack.\"","\n","ev","str","^\"I found the blade with which the boy was killed.\"","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","^You show him a bloody dagger. You see the guilt and despair painted on the man's face.","\n","^\"It's my fault. I thought I would be able to protect my employees and pay off my debt to the smugglers.\" ","#","^questComplete:InvestigateLowerCityPort:4","/#","\n","^\"I'm not going to explain myself. It's too late for that.\" ","#","^questStart:InvestigateLowerCityPort:5","/#","\n","^\"But I can ask you for one thing. Let's acknowledge that Ralph is to blame. He is the one who killed Jack in an effort to protect his position.\" ",{"->":"Start.Questions"},"\n",{"#f":5}]}],{"Questions":[["ev","str","^\"It makes no difference which of you will answer for Jack's death. What matters is that the port works.\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"Why should I help you?\"","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^\"You don't have the money to buy me.\"","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^\"Do you want to prosecute Ralph? I won't allow it!\"","/str","/ev",{"*":".^.c-3","flg":20},{"c-0":["\n","^\"Well, that's just it. Without me, the port will be closed until my successor is elected. Food, medicine, warm clothes. People will be left without them for weeks.\" ",{"->":"Decision"},"\n",{"#f":5}],"c-1":["\n","^\"I am the only one who can run the port without delays. People will get what they need to survive. Think of them, not me.\" ",{"->":"Decision"},"\n",{"#f":5}],"c-2":["\n","^\"I may not be able to pay you, but I can promise you that I will whisper a few words to the smugglers so that you will have respect from them. Who knows what you could use them for.\" ",{"->":"Decision"},"\n",{"#f":5}],"c-3":["\n","^\"You are condemning many lives in the city to death with this. They will be deprived of medicine and food. But the important thing is that one fool will answer for his mistake, won't he?\" ",{"->":"Decision"},"\n",{"#f":5}]}],{"#f":1}],"#f":1}],"Decision":[["^You know that this man's future is in your hands. No, not just his. Ralph, the people of the lower city, the workers of the port. You feel the weight of that responsibility.","\n","^You have to choose.","\n","ev","str","^Prosecute the port chief. He must answer for what he brought upon his subordinates.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Blame Ralph for Jack's death. This sacrifice will save many lives in the city and the port.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^The real killer escaped long ago. You can't prosecute someone who hasn't shed blood. ","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n","ev",true,"/ev",{"VAR=":"port_master_is_guilty","re":true},"^The man says nothing. He just looks at the floor. He knows what awaits him.","\n","^You leave it. You have to write up a report and give it to the city guard. He won't escape anyway. He has nowhere to go. ",{"->":"Ending"},"\n",{"#f":5}],"c-1":["\n","ev",true,"/ev",{"VAR=":"ralph_is_guilty","re":true},"^\"Forgive me for forcing you to make this choice. It is good that it turned out to be the right one.\"","\n","^The man's face shows the relief and peace he has been craving for days. Now it's time to complete your duties. ",{"->":"Ending"},"\n",{"#f":5}],"c-2":["\n","ev",true,"/ev",{"VAR=":"no_one_is_guilty","re":true},"^The man looks at you puzzled. After a moment, he smiles, finally recognizing your wisdom in making this decision.","\n","^\"If necessary, I will help find these smugglers. You can count on me.\" ",{"->":"Ending"},"\n",{"#f":5}]}],{"#f":1}],"Ending":["^You have fulfilled your task. You can go home.  ","#","^questComplete:InvestigateLowerCityPort:5","/#","\n","^Finally. ","end","\n",{"#f":1}],"global decl":["ev",false,{"VAR=":"ralph_is_guilty"},false,{"VAR=":"port_master_is_guilty"},false,{"VAR=":"no_one_is_guilty"},"/ev","end",null],"#f":1}],"listDefs":{}}