{"inkVersion":21,"root":[[{"->":"Start"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"Start":[["^As you head toward the port warehouses, you are accosted by an elderly worker. His face is covered with scars and dirt, but his smile seems genuine.","\n","^\"Entry to the port is prohibited. Since you're standing here, you must be the detective who was called?\"","\n","ev","str","^\"I wouldn't call myself a detective, but yes, I'm here for an investigation.\"","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","^\"I'm the one who sent for you. I'm Ralph Shaw. Someone needs to finally bring order here.\"","\n","^\"The port master is doing nothing to resolve the issue you are here to address.\"","\n",["ev","str","^\"So, why did you send for me?\"","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","^\"A few days ago we found the body of one of our own. The poor guy had just started work, and here he is met with such cruelty.\"","\n","^\"The port has been closed, and we are not allowed to leave its borders until we find the murderer. That's why I decided that someone from outside could help us.\" ",{"->":"Questions"},"\n",{"#f":5}]}],{"#f":5}]}],{"#f":1}],"Questions":[["ev","str","^\"Tell me more about this boy.\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"You mentioned the port master. What's the deal with him?\"","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^\"I will try to help. I don't promise anything.\"","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n","^\"His name was Jack. He was quiet and weak, but he tried his best. He didn't get under anyone's skin, at least not that I know of.\"","\n","^\"He didn't talk about himself much. I know he had money problems after having to take on the support of his sick mother.\" ",{"->":".^.^.^"},"\n",{"#f":5}],"c-1":["\n","^\"He is afraid. He has a lot to lose and is trying to play for time. I think he might know something about the murder and hide it.\"","\n","^\"I wouldn't trust him.\" ",{"->":".^.^.^"},"\n",{"#f":5}],"c-2":["\n","^\"Any help will bring us closer to resolving this madness.\" ","#","^questStart:InvestigateLowerCityPort:1","/#","\n","^\"Maybe you'd better find the port master and tell him the purpose of your visit. You might even be able to get something out of him.\" ","end","\n",{"#f":5}]}],{"#f":1}],"#f":1}],"listDefs":{}}